---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallSweepCutByInsertsParam
source: html/66461bd2-2082-0aa1-c93c-80a2c9982fcb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallSweepCutByInsertsParam Property

"Cut by Inserts"

## Syntax (C#)
```csharp
public static ForgeTypeId WallSweepCutByInsertsParam { get; }
```